{
  "0" : {
    "description" : "Innovating is hard. Doing it in a way that has a strong chance of producing positive results and allows you to manage costs is harder.\n\nDesign Sprints, developed by Google Ventures and IDEO allow an organization to do exactly that. It is a method, now proven the world over, that makes asks for a team built of people who can brainstorm and think well outside the norm yet the Sprint methodology keeps them on track and within a scope that is doable. The team goes through a predefined series of steps on a schedule so that within 3 or 5 days (chosen at the beginning) they have created an idea and tested a prototype they build. The team itself is composed of people who can then take that tested idea back into the organization and see it worked on and actually developed.",
    "id" : 0,
    "title" : "Google Design Sprint: The Next Step in Innovation Management",
    "speakers": [
      26
    ],
    "type": "Talk",
    "tags":[
      "UX"
    ]
  },
  "1" : {
    "description" : "Get your badge, coffee, enjoy talking with tech edicts around",
    "id" : 1,
    "image" : "/images/backgrounds/registration.jpg",
    "title" : "Registration & morning coffee",
    "track" : {
      "title": "Circle Hall"
    }
  },
  "2" : {
    "description" : "Foooooood!",
    "id" : 2,
    "image" : "/images/backgrounds/lunch.jpg",
    "title" : "Lunch",
    "track" : {
      "title": "First floor of the coridor of the Faculty of Economics and Management"
    }
  },
  "3" : {
    "description" : "Boost your energy, network, play a game?",
    "id" : 3,
    "image" : "/images/backgrounds/coffee-break.jpg",
    "title" : "Coffee break",
    "track" : {
      "title": "First floor of the coridor of the Faculty of Economics and Management"
    }
  },
  "4" : {
    "description" : "Official start of the conference with some suprises included :)",
    "id" : 4,
    "image" : "/images/backgrounds/opening.jpg",
    "language" : "English",
    "title" : "Opening Ceremony",
    "track" : {
      "title": "Circle Hall"
    }
  },
  "5" : {
    "description" : "Google I/O-inspired fun & networking",
    "id" : 5,
    "image" : "/images/backgrounds/party.jpg",
    "title" : "Afterparty & Networking",
    "track" : {
      "title": "Cafeteria (Menza)"
    }
  },
  "6" : {
    "description" : "Grand finale and awarding contest winners",
    "id" : 6,
    "image" : "/images/backgrounds/closing.jpg",
    "title" : "Closing Ceremony",
    "language" : "English",
    "track" : {
      "title": "Circle Hall"
    }
  },
  "7" : {
    "description" : "7 speakers, 7 minutes each. Strictly.",
    "id" : 7,
    "title" : "Lightning talks",
    "language" : "Czech/English"
  },
  "8" : {
    "description" : "Boot up for your DevFest day",
    "id" : 8,
    "image" : "/images/backgrounds/coffee-break.jpg",
    "title" : "Coffee",
    "track" : {
      "title": "First floor of the coridor of the Faculty of Economics and Management"
    }
  },
  "100": {
    "complexity": "Intermediate",
    "description": "Want a more productive way to build for mobile? Flutter is an SDK for building high-performance, high-fidelity, apps for iOS and Android, from a single code-base. Flutter delivers a great developer experience in part because it is based on Dart, which allows you to build your cross-platform mobile apps in an approachable and analyzable language with sub-second edit-and-continue support baked in. Come see what makes Flutter special and learn how you can become a more productive mobile developer. ",
    "id": 100,
    "type": "Talk",
    "language": "English",
    "speakers": [
      1
    ],
    "tags": [
      "Dart"
    ],
    "title": "Flutter: The best way to build for mobile?"
  },
  "101": {
    "complexity": "Intermediate",
    "description": "In this presentation, Rebecca will look into using the Android Things platform as a way in which you can build connected products using Android. Rebecca will cover controlling your Android Things device with the Google Assistant. She will also talk through some different options for storing data for IoT devices. She will also showcase a few different applications of Android Things. ",
    "id": 101,
    "type": "Talk",
    "language": "English",
    "speakers": [
      2
    ],
    "tags": [
      "Android"
    ],
    "title": "Building a Connected Product using Android Things"
  },
  "102": {
    "complexity": "Beginner",
    "description": "The main thought - developers should be able to enjoy their work. \nAssume you’ve started working on development of the web application. By the time you’ve got to the spot of enjoyable developemt, you would have to go through all the complex details of  building the basement for your app, taking care about the backend, servers and more...Cloud Functions allows Firebase developers to create a backend without having to worry about servers. During the talk you will learn what's possible with Cloud Functions and how it can be used for many different key use cases for your web app. You'll see real world examples that show how Cloud Functions for Firebase is the programmatic glue that allows you to extend and connect Firebase products and cloud services.\n",
    "id": 102,
    "type": "Talk",
    "language": "English",
    "speakers": [
      3
    ],
    "tags": [
      "Firebase",
      "Cloud"
    ],
    "title": "Go beyond the web development with Firebase Cloud Functions"
  },
  "103": {
    "complexity": "Intermediate",
    "description": "Managing modern infrastructure presents many different challenges. While the main operational aspects of infrastructure like durability, availability, scalability, security are very important, there’s also one aspect which should enable and support all the others - automation.\n \nAutomation is a very abstract word, so the talk will briefly explain what benefits does IaC approach bring to the table and why configuration management (often driven by tools like Ansible, Puppet, Salt, Chef etc.) is just one of many layers in an automated production infrastructure.\n \nThen we will walk through the main design goals of Terraform, open source tool that enables users to write, plan and apply changes of a production infrastructure in Google Cloud, and explain how to do it.",
    "id": 103,
    "language": "English",
    "type": "Talk",
    "speakers": [
      4
    ],
    "tags": [
      "Cloud"
    ],
    "title": "Infrastructure as Code in Google Cloud"
  },
  "104": {
    "complexity": "Intermediate",
    "description": "Prodeje a počty stažení vaší aplikace jsou do značné míry dány tím, jak aplikaci navrhnete. Měli byste se nad tím tedy zamýšlet ještě dřív, než napíšete první řádku kód.\n\nTomáš se s vámi podělí o zkušenosti, které nasbíral za víc než pět let, co aplikace navrhuje, programuje a prodává na Play Store.\n\nPřednáška je marketingová, ale je určena pro vývojáře a menší týmy, které přemýšlí nad nějakou aplikací, kterou by chtěli v budoucnu prodávat, ale zatím nevědí jak na to. Těm může ušetřit spoustu času, nervů a zklamání při uvedení aplikace na trh.",
    "id": 104,
    "type": "Talk",
    "language": "Czech",
    "speakers": [
      5
    ],
    "tags": [
      "Marketing"
    ],
    "title": "Jak nadesignovat aplikaci, aby se dobře prodávala na Play Store"
  },
  "105": {
    "complexity": "Beginner",
    "description": "The future of med & tech is contact-less. The future is now and the tricoder from Star Track is just one step away. Our presentation shows how we are able to detect movement/activity or even breathing in a contact-less fashion on Android phones using just their speaker and microphone. How we utilize this for sleep phase tracking in our app Sleep as Android (15M Downloads). What challenges we are facing with the technology in terms of development, hardware, background processes, Android's audio system but also signal processing, false positive filtering etc..",
    "id": 105,
    "language": "English",
    "type": "Talk",
    "speakers": [
      6, 40
    ],
    "tags": [
      "Android"
    ],
    "title": "Sonar or the Tricoder (how we created a new smartphone sensor)"
  },
  "107": {
    "complexity": "Beginner",
    "description": "At I/O this year, the Room persistence library was introduced as part of the Architecture Components effort. In this talk we'll look at what Room has to offer, why and when you should use it and how it compares to existing solutions. We'll also take a look at how Room works under the covers and how it integrates with other Architecture components and RxJava.",
    "id": 107,
    "language": "English",
    "type": "Talk",
    "speakers": [
      8
    ],
    "tags": [
      "Android"
    ],
    "title": "Room: the blessed Object Mapper"
  },
  "108": {
    "complexity": "Advanced",
    "description": "Are you working on the client library? Or design a public API for the module that is going to be used by other team or department?\n\nIn this session, Vitality will share his experience and key learnings from building a mobile SDKs for last 4 years:\n\nwhat is the cost of too complex API and how to simplify it;\nwhat aspects of the library are important for clients;\nhow documentation should look like to avoid stupid and repetitive support questions;\nhow to make library update process smooth.\nThe session will be interesting for Android and iOS developers who want to learn what makes client library great. What are the best practices and common pitfalls in public API design? What is important, only programming API you expose or also ecosystem around?",
    "id": 108,
    "language": "English",
    "type": "Talk",
    "speakers": [
      9
    ],
    "tags": [
      "Android",
      "iOS"
    ],
    "title": "How not to fuckup with building SDK and make clients happy"
  },
  "109": {
    "complexity": "Beginner",
    "description": "Virtual Reality is a new technology used for building realistic experiences for games, environments, content display as well as marketing. Any person with a basic understanding of HTML5, CSS and JavaScript would be able to follow through the code examples. The talk would run through topics like VR, WebVR API, A Frame and designs, testing applications on Google Cardboard and so on. In these apps, users will be able to test the VR environments on their laptops, walk through the virtual world, interact with the objects as well as perceive these virtual realities with the help of Google Cardboard. By the end of the session, the user will have a complete understanding of what WebVR is, various VR devices available, requirements to start working on WebVR and the popular WebVR based projects. The user will also be comfortable in using A-Frame and its various components to build their own VR projects.",
    "id": 109,
    "language": "English",
    "type": "Talk",
    "speakers": [
      10
    ],
    "tags": [
      "UX"
    ],
    "title": "Web Based Virtual Reality"
  },
  "110": {
    "complexity": "Intermediate",
    "description": "Progressive Web Apps are the new hotness with Google pressing hard to make them the defacto choice for building mobile applications but what's to be done about iOS where many of the key API's are not supported. That's where Apache Cordova/PhoneGap comes in by polyfilling the missing functionality. In this talk I'll show you how to create a PWA that runs on the web, Android and iOS from a single code base. Take advantage of some new tools to easily deploy and test your PWA.\n\nI will begin with a brief overview of Progressive Web Apps, what features make your web app progressive and which API's you can take advantage of. Then I will discuss the availability of these API's on various platforms. Taking care not to completely dump on Apple for falling behind. No, that's a lie. I will jokingly take Apple to task.\n\nOnce the promise of PWA's has been illustrated and the problem of them not exactly being cross platform I will introduce Apache Cordova/PhoneGap, briefly, explaining how you can use Apache Cordova/PhoneGap to deploy a web application to Android and iOS. This will lead me into explaining how Cordova plugins allow us to polyfil the missing functionality on iOS.",
    "id": 110,
    "language": "English",
    "type": "Talk",
    "speakers": [
      11
    ],
    "tags": [
      "Web"
    ],
    "title": "Cross Platform Progressive Web Apps"
  },
  "111": {
    "complexity": "Advanced",
    "description": "What is the first thing that comes to your mind when you are starting to develop your product? You need to think about all sort of features. How you are going to grow your app. Engage your audience and make money in the process, right? \nWhat if you could choose a platform to build your app with confidence, without the need of managing infrastructure, trusted by companies like The New York Times, The Economist, Shazam and much more. Firebase gives you the tools and infrastructure you need to build better apps and grow businesses. Join this talk and learn how to overcome the challenges of build extraordinary front-end apps using Firebase.",
    "id": 111,
    "language": "English",
    "type": "Talk",
    "speakers": [
      12
    ],
    "tags": [
      "Firebase"
    ],
    "title": "Let Firebase help you to build better Front-end apps"
  },
  "112": {
    "complexity": "Beginner",
    "description": "In a plain-looking computer room sits 30+ men wearing khaki-colored shirts and pants, each staring intently at their monitors. Some young, some old, some with tattoos, all with different life stories. These men--many of which have never been on the Internet-- are learning computer programming while serving time at Washington State's second largest prison. \n\nGaining employment upon release from prison is one of the largest indicators of successful re-entry into society. With today’s booming tech market, these currently incarcerated men hope to gain the skills needed to obtain web development jobs upon release. \n\nHowever, learning programming inside a prison isn’t easy. Each student computer is highly locked-down with limited software and absolutely no Internet access. While most programmers enjoy the benefits of Google and StackOverflow, these students must work with what is available on the classroom’s local network and in the outdated computer manuals available in the facility library.\n\nMy name is Sarabeth Jaffe and I teach computer programming at Monroe Correctional Complex. In this talk, I will discuss the many challenges of teaching web development without the web, the Open Source technology that makes it possible, and the many opportunities we--as technologists--have to spread the benefits of the technical knowledge to disadvantaged populations.\n\nThe session will be played from a recording and then Sarabeth will connect live for questions.",
    "id": 112,
    "language": "English",
    "type": "Talk",
    "speakers": [
      13
    ],
    "tags": [
      "Web"
    ],
    "title": "Programming in Prison: Web Development behind Bars [STREAM]"
  },
  "114": {
    "complexity": "Advanced",
    "description": "Že je multiplaformní vývoj mýtus a vede jen ke kompromisům na úkor kvality? To jsme si také mysleli. Ale stále jsme se nemohli smířit s tím, že musíme prakticky stejnou aplikaci programovat 2x...\n\nJ2ObjC je nástroj od Google, který dokáže převést společný Java kód do Objective-C. Nevizuální část aplikace (HTTP komunkace, lokální databáze, výpočty, zpracování dat atd.) se tak programuje pouze jednou a následně se použíje jak v Android tak i v iOS verzi. Výsledný kód je nativní pro obě platformy. Jak na to si ukážeme na příkladu reálné aplikace přímo na zdrojových kódech aplikace Rundogo (http://www.rundogo.com).\n\n- co je vhodné zahrnout do společného kódu?\n- integrace Java se Swift (iOS) a Java a Kotlin (Andorid)\n- pohodlný build systém a integrace s xCode\n- debugování Java backendu přímo v xCode\n- a další best practices, které náš tým vytvořil během 5ti měsíců vývoje aplikace Rundogo",
    "id": 114,
    "language": "Czech",
    "type": "Talk",
    "speakers": [
      15
    ],
    "tags": [
      "Android",
      "iOS"
    ],
    "title": "Úspěšný vývoj multiplaformní aplikace pomocí J2ObjC"
  },
  "115": {
    "complexity": "Intermediate",
    "description": "Beyond seven mountain ranges, beyond seven rivers and beyond seven Google buildings lived a technology called Angular. One day it met another technology - Firebase and they decided to do an App together. In this talk I will show you why AngularDart is a framework you should definitely take a look at and how you can use it together with Firebase to build great apps!",
    "id": 115,
    "language": "English",
    "type": "Talk",
    "speakers": [
      16
    ],
    "tags": [
      "Dart",
      "Web"
    ],
    "title": "How AngularDart & Firebase did an App together"
  },
  "116": {
    "complexity": "Beginner",
    "description": "Do you wish you could click autocomplete an exotic language or drill down into framework String parameters? But sadly there's no IDE plugin for that, what a shame.. But do not fear, we have a solution! Let's explore how we could make our own plugin for our favourite tool. We will start with capability overview of plugin API, get into parsers and lexers, syntax highlight, adding buttons to toolbars, etc. As well as briefly cover best practices, build system configurations and deployment to get your plugin into the wilds into the plugin store!",
    "id": 116,
    "language": "English",
    "type": "Talk",
    "speakers": [
      17
    ],
    "tags": [
      "Android"
    ],
    "title": "Writing A Plugin for Android Studio"
  },
  "117": {
    "complexity": "Beginner",
    "description": "Ukážeme si, co Dart je, co Dart není a k čemu je Dart aktuálně dobrý. Porovnáme syntaxi a konstrukce Javy a Dartu a ukážeme si, proč právě javistům se Dart bude líbit.",
    "id": 117,
    "language": "Czech",
    "type": "Talk",
    "speakers": [
      18
    ],
    "tags": [
      "Dart"
    ],
    "title": "Dart pro Javisty"
  },
  "119": {
    "complexity": "Intermediate",
    "description": "A recap on what HTTP/2 brought that HTTP/1 couldn't offer before we dig in and look at some numbers that show how HTTP/2 has improved today's (browser)networking and the web experience for people.\n\nStill, there are scenarios where HTTP/1's multiple connections win over HTTP/2 in performance tests. Why is that and what is being done about it? Wasn't HTTP/2 supposed to be the silver bullet?\n\nA closer look at QUIC, its promises to fix the areas where HTTP/2 didn't deliver and a check on where it is today. Is QUIC perhaps HTTP/3 in everything but the name?",
    "id": 119,
    "language": "English",
    "type": "Talk",
    "speakers": [
      20
    ],
    "tags": [
      "Web"
    ],
    "title": "HTTP/2"
  },
  "121": {
    "complexity": "Intermediate",
    "description": "Service Workers, without a doubt, have been the new cool in the Javascript community in recent years. In this session we dive into what’s in store beyond providing the offline experience, push and background sync features. This talk examines how Service Workers fill the gap between web and native, and how they give better performance and user experiences.",
    "id": 121,
    "language": "English",
    "type": "Talk",
    "speakers": [
      22
    ],
    "tags": [
      "Web"
    ],
    "title": "Service workers and their role in PWAs"
  },
  "122": {
    "complexity": "Beginner",
    "description": "Let's take a look into the world of IoT devices. How much time will it take to hack a coffee machine or a kettle, get inside your local network or use remote control apps against you.",
    "id": 122,
    "language": "English",
    "type": "Talk",
    "speakers": [
      23
    ],
    "tags": [
      "IoT"
    ],
    "title": "Dark side of IoT"
  },
  "123": {
    "complexity": "Advanced",
    "description": "Internet of Things (IoT) covers many areas, but the most interesting ones (at least for me) are Robotics and AI. Where is the moment when a machine or robot is 'smart enough'? Let's explore this area a bit together and let's see some examples. How difficult is to build a Smart Robot? Could you build one at home? The answer is Yes! And I will show you how. From the basic steps on #Arduino, to the beauty of more complex examples and solutions like SLAM, optical recognition, path finding or steering behaviours. Live demo is included!",
    "id": 123,
    "language": "Czech",
    "type": "Talk",
    "speakers": [
      24
    ],
    "tags": [
      "IoT"
    ],
    "title": "When a Robot is smart enough?"
  },
  "124": {
    "complexity": "Beginner",
    "description": "Using Kotlin for Android development has grown in popularity over the last year especially after this year's Google I/O 17 where Google announces Kotlin for Android to be a first-class language for writing Android apps.\n\nIn this talk, we will go through all advantages of using Kotlin for Android development. You will see how can be a development of Android apps again fun. You will get answers to questions such like: Should I rewrite a whole application to Kotlin? Should I wait? Where is the power of Kotlin for Android and what tools are available? You will learn Anko library and Kotlin Extensions... Less code, more fun.",
    "id": 124,
    "language": "English",
    "type": "Talk",
    "speakers": [
      25
    ],
    "tags": [
      "Android"
    ],
    "title": "Kotlin for Android"
  },
  "200": {
    "complexity": "Intermediate",
    "description": "Containers are great, but container technologies solve only part of the problem. Once you get container images, you need to run them, orchestrate them, scale them, make sure they don't fail randomly etc. This is a task for tools - and there are couple of them. Luckily, they share basic concepts. Sadly, containerisation and specifically making your app ready for scalable environment, might require you to change your app. You'll learn about these concepts and how orchestration of containerised applications work in this presentation. You need to bring your laptop.",
    "id": 200,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      27
    ],
    "tags": [
      "Cloud"
    ],
    "title": "Basic Concepts of Containers Orchestration"
  },
  "201": {
    "complexity": "Advanced",
    "description": "Have you ever wondered how to provide sensitive customer data to third parties and still maintain privacy and client’s secret? How to enable partners to mine for wealth and knowledge in client’s data, that we can use to provide better customer experience later? And how to protect client’s data and yet go hand in hand with the trend of Open APIs and Open banking? The solution is simple: Homomorphic encryption. So you know, it is not so easy, but later on :)",
    "id": 201,
    "language": "English",
    "type": "Talk",
    "speakers": [
      28
    ],
    "tags": [
      "General"
    ],
    "title": "Morfina - The World Unique Homomorphic Encrypted Open API"
  },
  "202": {
    "complexity": "Intermediate",
    "description": "There is a lot of hype around the serverless architecture and for many products having dedicated servers might not be cost-effective. Such products are the perfect use case for Firebase.\nFirebase Functions allow you to execute computation directly in the cloud without caring about instances, containers and other infrastructure details.\nThere is also a lot of hype around Kotlin and since the release of Kotlin 1.1 it is possible to transpile it to JavaScript, receiving all the benefits of this pragmatic and robust language.\n\nIn this workshop we will try to combine both hyped technologies together and see what happens. This is pretty ambitious goal that covers several loosely related topics, therefore at least basic understanding of JavaScript, Kotlin and Firebase is recommended.\n\nBefore this workshop it is recommended to prepare several things (mostly download and install some software):\nYou should have Google developer account with ability to create Firebase projects (https://console.firebase.google.com/). Creation of such account is out of scope of workshop.\nYou should have Node.js and Firebase CLI installed (https://firebase.google.com/docs/cli/).\nYou should have some text editor/IDE for work with JavaScript. (VS Code, Atom, Sublime, Vim etc).\nYou should have latest version of Intellij Idea installed (https://www.jetbrains.com/idea/). Community edition is more than sufficient.",
    "id": 202,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      29
    ],
    "tags": [
      "Firebase"
    ],
    "title": "Writing Firebase Functions in Kotlin"
  },
  "204": {
    "complexity": "Beginner",
    "description": "One of the hardest things to do in any social situation is to get the courage to introduce yourself and talk to people you don't know. This workshop will help you lose the fear and will give you some practical strategies for networking.",
    "id": 204,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      31
    ],
    "tags": [
      "Soft skills"
    ],
    "title": "Networking for Geeks"
  },
  "205": {
    "complexity": "Intermediate",
    "description": "Workshop is about migrating classical LAMP (or functional equivalent) stack from \"onpremise\" to GCP. Replace DB, storage, monitoring, FW, by Google managed services, add fail-over, high-availability, load balancing and automatic scaling instances according to load, balance costs of entire solution. We will secure entire solution central access right management. Just come with any computer with modern web-browser installed, preferably Chrome in latest stable version.",
    "id": 205,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      32
    ],
    "tags": [
      "Cloud"
    ],
    "title": "Move to Google Cloud Platform, and stop worrying"
  },
  "206": {
    "complexity": "Beginner",
    "description": "If you didn't fail did you know why you succeeded? Do you know what worked so you could repeat it again when needed? I don't think that's true. We learn the most when we fail. We know what didn't work and using that knowledge we can improve next attempt. While failure is always an option (at least should be!), your job isn't the best place for failures. That's why I'd like to invite you to join Coding Dojo.\n\nCoding Dojo is a place for practice in a safe environment. You can fail, learn and repeat until you feel your skills are improved. This session would be held in order to practice Test Driven Development in pairs or small groups. No prior knowledge of TDD is required.\n\nDepending on whether you want to use Python or PHP please install pytest or PHPUnit (preferably 6.x) on your laptop that you'll bring with you.",
    "id": 206,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      33
    ],
    "tags": [
      "General"
    ],
    "title": "Coding Dojo"
  },
  "207": {
    "complexity": "Intermediate",
    "description": "How to write system which makes you money",
    "id": 207,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      34
    ],
    "tags": [
      "AI"
    ],
    "title": "Crypto currency trading algorithm"
  },
  "208": {
    "complexity": "Advanced",
    "description": "Use modern browser APIs to capture and process real-time multimedia data. We will tackle the Web Audio API, Canvas2D, MediaDevices and more!",
    "id": 208,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      35
    ],
    "tags": [
      "Web"
    ],
    "title": "Experiments with real-time audio/video processing in JavaScript"
  },
  "209": {
    "complexity": "Advanced",
    "description": "Welcome to our \"failcon\" story of how we created Robeeto - a startup of shared economics. Learn from our mistakes and more - how to work with the initial idea, who else do you need except you as a developer. How we learned from our mistakes, redesigned the idea and created an ecosystem of people who love what they do. Step by step, we will look at the process from idea to creating your own monster. So you can call with us - It's aliiiiive!!! ",
    "id": 209,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      36, 41
    ],
    "tags": [
      "Soft skills"
    ],
    "title": "From idea to running a firm - step by step"
  },
  "210": {
    "complexity": "Intermediate",
    "description": "Google Assistant is popular for doing the tasks such as - calls, mails, songs play, weather check, traffic update. But for developers like us we need an assistant do help us in coding , help us in code review and doing so many stuff to keep us free to focus on important things such as - Learning and more coding. So here we are with our Google assistant to assist us in our coding tasks. \n\nYou will need:\nPython/Javascript & your own Raspberry Pi\n\nWhat we will do:\nWe will develop a Google Assistant SDK to help developers in task such us:\n1) Code Commit\n2) Code review\n3) Priorities code bug/error\n4) Suggestions of solutions based on Bugs logged\n5) Creating reports ",
    "id": 210,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      37, 38
    ],
    "tags": [
      "Assistant"
    ],
    "title": "Okay Google, let's do the code review"
  },
  "211": {
    "complexity": "Beginner",
    "description": "Write complex applications in Angular. Think of reusable services and low level versus high level logic.",
    "id": 211,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      39
    ],
    "tags": [
      "Web"
    ],
    "title": "Angular4 in Action"
  },
  "212": {
    "complexity": "Beginner",
    "description": "Is Hadoop MapReduce dead and what will replace it? In last decade, the MapReduce became the standard for a work with a huge amount of data. This paradigm helps us process information, but the concept of adjusting all problems into only two stages, map and reduce, is already overcome. There are many other approaches and frameworks that help us to get the right questions and the right answers from data.\n\nOne of the many frameworks that provide different approach than MapReduce is Apache Spark (https://spark.apache.org/). The project that is used by the many companies that have access to lot of data like Yahoo, eBay, Alibaba, Yandex, Baidu, Netflix, TripAdvisor, etc.) We will go through an introduction to the concepts of the Apache Spark and then we will try to create our own Spark application. All that you need for the workshop is laptop and knowledge of Java or Scala language.",
    "id": 212,
    "language": "English",
    "type": "Workshop",
    "speakers": [
      42
    ],
    "tags": [
      "Cloud"
    ],
    "title": "An Introduction to Apache Spark"
  }
}
